test/soap-apis/testcases/validate_add_numbers_method_soap_1_2.json

{
  "details": {
    "summary": "Validate Add Numbers Method SOAP 1.2"
  },
  "validation": {
    "assertions": [
      {
        "source": "statusCode",
        "property": null,
        "operator": "equalToNumber",
        "expectedValue": "200"
      },
      {
        "source": "textBody",
        "property": null,
        "operator": "Default Validator",
        "expectedValue": ""
      }
    ],
    "expectedBody": {
      "content": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://www.w3.org/2003/05/soap-envelope\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\">\n  <soap:Body>\n    <AddResponse xmlns=\"http://tempuri.org/\">\n      <AddResult>{{addResult}}</AddResult>\n    </AddResponse>\n  </soap:Body>\n</soap:Envelope>",
      "type": "xml"
    }
  },
  "request": {
    "url": "http://www.dneonline.com/calculator.asmx",
    "method": "POST",
    "body": {
      "content": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap12:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\n  <soap12:Body>\n    <Add xmlns=\"http://tempuri.org/\">\n      <intA>{{firstNumber}}</intA>\n      <intB>{{secondNumber}}</intB>\n    </Add>\n  </soap12:Body>\n</soap12:Envelope>",
      "type": "xml"
    },
    "headers": {
      "Content-Type": "text/xml"
    }
  }
}